package cn.yiueil.util;

/**
 * Author:YIueil
 * Date:2022/4/22 17:42
 * Description: 虚假数据生成工具类
 * todo 增加初始化种子模式
 */
public class FakeUtils {
    public static String base = "abcdefghijklmnopqrstuvwxyz0123456789";

    public static final String sanguo = "荀彧、荀攸、贾诩、郭嘉、程昱、戏志才、刘晔、蒋济、陈群、华歆、钟繇、满宠、董昭、王朗、崔琰、毛玠、杜畿、田畴、王修、杨修、辛毗、杨阜、田豫、王粲、蒯越、张继、杜袭、枣祗、任峻、陈矫、郗虑、桓玠、丁仪、丁廙、司马朗、韩暨、韦康、邴原、赵俨、娄圭、贾逵、陈琳、司马懿、张辽、徐晃、夏侯惇、夏侯渊、庞德、张郃、李典、乐进、典韦、曹洪、曹仁、曹彰、曹纯、于禁、许褚、吕虔、李通、文聘、臧霸、郭淮、钟会、邓艾、曹休、张燕、张绣、朱灵、路昭、史涣、韩浩、王凌、孙礼、秦朗、郑文、夏侯尚、毌丘俭、诸葛诞、孙乾、简雍、糜竺、糜芳、庞统、法正、许靖、马良、徐庶、陈震、杨仪、费祎、蒋琬、孟优、黄皓、诸葛亮、关羽、张飞、马超、黄忠、赵云、魏延、关平、周仓、关兴、张苞、陈到、李严、姜维、廖化、马谡、马岱、陈式、雷铜、吴兰、王平、任夔、张翼、马忠、张南、冯习、傅佥、关索、陆逊、张昭、张紘、鲁肃、虞翻、顾雍、诸葛谨、诸葛恪、陆凯、骆统、周鲂、周瑜、吕蒙、甘宁、太史慈、程普、黄盖、韩当、周泰、蒋钦、丁奉、徐盛、陈武、凌操、凌统、潘璋、朱然、孙桓、马忠、孙韶、朱桓、夏恂、周平、全琮、于诠、张角、何进、董卓、袁绍、吕布、袁术、刘表、刘璋、马腾、张鲁、韩遂、公孙瓒、韩馥、刘岱、王匡、张邈、孔伷、陶谦、鲍信、桥瑁、袁遗、孔融、张超、张杨、刘度、赵范、金旋、韩玄、张宝、张梁、程远志、邓茂、马元义、赵弘、韩忠、孙夏、管亥、何仪、刘辟、龚都、裴元绍、高升、张闿、韩暹、李乐、杨奉、董承、王子服、李儒、陈宫、田丰、沮授、审配、许攸、郭图、逢纪、辛评、荀谌、陈登、蒯良、王累、韩胤、沮鹄、杨弘、阎象、蒯越、伍孚、李傕、郭汜、颜良、文丑、潘凤、俞涉、武安国、穆顺、华雄、牛辅、张济、樊稠、胡轸、胡车儿、李肃、高顺、张任、高览、曹性、闵纯、纪灵、马休、马铁、高览、袁谭、袁熙、袁尚、高干、麴义、吕翔、吕旷、韩猛、淳于琼、焦触、张南、马延、雷薄、张勋、陈纪、桥蕤、郝萌、侯成、宋宪、魏续、成廉、蔡瑁、张允、黄祖、苏飞、吕公、侯选、程银、李堪、张横、梁兴、成宜、马玩、杨秋、张让、赵忠、封谞、段珪、侯览、蹇硕、程旷、夏恽、郭胜、曹节、吕伯奢、普净、华佗、于吉、左慈、吉平";

    public static final String[] firstname = "赵,钱,孙,李,周,吴,郑,王,冯,陈,褚,卫,蒋,沈,韩,杨,朱,秦,尤,许,何,吕,施,张,孔,曹,严,华,金,魏,陶,姜,戚,谢,邹,喻,柏,水,窦,章,云,苏,潘,葛,奚,范,彭,郎,鲁,韦,昌,马,苗,凤,花,方,俞,任,袁,柳,酆,鲍,史,唐,费,廉,岑,薛,雷,贺,倪,汤,滕,殷,罗,毕,郝,邬,安,常,乐,于,时,傅,皮,卞,齐,康,伍,余,元,卜,顾,孟,平,黄,和,穆,萧,尹,姚,邵,湛,汪,祁,毛,禹,狄,米,贝,明,臧,计,伏,成,戴,谈,宋,茅,庞,熊,纪,舒,屈,项,祝,董,梁,杜,阮,蓝,闵,席,季,麻,强,贾,路,娄,危,江,童,颜,郭,梅,盛,林,刁,钟,徐,邱,骆,高,夏,蔡,田,樊,胡,凌,霍,虞,万,支,柯,昝,管,卢,莫,经,房,裘,缪,干,解,应,宗,丁,宣,贲,邓,郁,单,杭,洪,包,诸,左,石,崔,吉,钮,龚,程,嵇,邢,滑,裴,陆,荣,翁,荀,羊,於,惠,甄,麴,家,封,芮,羿,储,靳,汲,邴,糜,松,井,段,富,巫,乌,焦,巴,弓,牧,隗,山,谷,车,侯,宓,蓬,全,郗,班,仰,秋,仲,伊,宫,宁,仇,栾,暴,甘,钭,厉,戎,祖,武,符,刘,景,詹,束,龙,叶,幸,司,韶,郜,黎,蓟,薄,印,宿,白,怀,蒲,邰,从,鄂,索,咸,籍,赖,卓,蔺,屠,蒙,池,乔,阴,欎,胥,能,苍,双,闻,莘,党,翟,谭,贡,劳,逄,姬,申,扶,堵,冉,宰,郦,雍,舄,璩,桑,桂,濮,牛,寿,通,边,扈,燕,冀,郏,浦,尚,农,温,别,庄,晏,柴,瞿,阎,充,慕,连,茹,习,宦,艾,鱼,容,向,古,易,慎,戈,廖,庾,终,暨,居,衡,步,都,耿,满,弘,匡,国,文,寇,广,禄,阙,东,殴,殳,沃,利,蔚,越,夔,隆,师,巩,厍,聂,晁,勾,敖,融,冷,訾,辛,阚,那,简,饶,空,曾,毋,沙,乜,养,鞠,须,丰,巢,关,蒯,相,查,後,荆,红,游,竺,权,逯,盖,益,桓,公,万俟,司马,上官,欧阳,夏侯,诸葛,闻人,东方,赫连,皇甫,尉迟,公羊,澹台,公冶,宗政,濮阳,淳于,单于,太叔,申屠,公孙,仲孙,轩辕,令狐,钟离,宇文,长孙,慕容,鲜于,闾丘,司徒,司空,亓官,司寇,仉,督,子车,颛孙,端木,巫马,公西,漆雕,乐正,壤驷,公良,拓跋,夹谷,宰父,谷梁,晋,楚,闫,法,汝,鄢,涂,钦,段干,百里,东郭,南门,呼延,归,海,羊舌,微生,岳,帅,缑,亢,况,后,有,琴,梁丘,左丘,东门,西门,商,牟,佘,佴,伯,赏,南宫,墨,哈,谯,笪,年,爱,阳,佟,第五,言,福,百,家,姓,终".split(",");

    public static final String[] lastname = "一,二,三,四,五,六,七,八,九,十".split(",");

    /**
     * 返回手机号码
     */
    private static final String[] telFirst = "134,135,136,137,138,139,150,151,152,157,158,159,130,131,132,155,156,133,153".split(",");

    public static int getNum(int start, int end) {
        return (int) (Math.random() * (end - start) + start);
    }

    /**
     * 生成手机号
     *
     * @return 随机的一个手机号
     */
    public static String getPhone() {
        int index = getNum(0, telFirst.length - 1);
        String first = telFirst[index];
        String second = String.valueOf(getNum(1, 888) + 10000).substring(1);
        String third = String.valueOf(getNum(1, 9100) + 10000).substring(1);
        return first + second + third;
    }

    public static String getEmail() {
        return null;
    }

    public static String getIdCard() {
        return null;
    }

    /**
     * 获得一个中文人名
     * @return 随机一个中文人名
     */
    public static String getChineseName() {
        StringBuilder sb = new StringBuilder();
        sb.append(firstname[getNum(0, firstname.length)]);
        sb.append(lastname[getNum(0, lastname.length)]);
        if (Math.random() % 2 > 0.5) {
            sb.append(lastname[getNum(0, lastname.length)]);
        }
        return sb.toString();
    }

}
